courseContent = {
    "1" : {
        "name":"计算机发展简史", 
        "content":{
                "1.1":"第一台数字计算机的诞生",
                "1.2":"计算机的发展",
                "1.3":"计算机的分类"
                }
        },
    "2" : {
        "name":"计算机专业知识体系", 
        "content":{
                "2.1":"计算机专业学生应具备的素质",
                "2.2":"计算机专业知识体系",
                }
        },
    "3" : {
        "name":"计算机基础知识", 
        "content":{
                "3.1":"计算机的基本组成及工作原理",
                "3.2":"计算机硬件子系统",
                "3.3":"计算机软件子系统",
                }
        },
}

print(courseContent["2"]["content"]["2.1"])

